In [ ]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

1. Display top 3 rows of the dataset

In [6]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

2. Display last 3 rows of the dataset

In [7]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

3. Find shape of our dataset (number of rows and columns)

In [9]:
print(f"Number of rows: {df1.shape[0]}")
print(f"Number of columns: {df1.shape[1]}")

Number of rows: 7
Number of columns: 3

4. Get information about dataset

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

5. Check null values in dataset

In [14]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

6. Get overall statistics about the dataframe

In [5]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

7. Find unique values from Gender column

In [6]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

8. Find a number of unique values from Gender column

In [8]:
df1['Gender'].nunique()

2

9. Display the count of unique values in "Gender" column

In [9]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

10. Find a total number of students with marks between 90 and 100

In [10]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [12]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [13]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [15]:
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [17]:
sum(df1['Marks'].between(90,100))

4

11. Find average marks

In [19]:
round(df1['Marks'].mean())

92

In [20]:
df1['Marks'].min()

83

In [23]:
df1['Marks'].max()

99

12. Apply method

In [26]:
def marks(x):
    return x//2

In [34]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [35]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [38]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [39]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

13. Map function

In [42]:
df1['Gender_By_0/1']=df1['Gender'].map({'Male':1, 'Female':0})
df1

      Name  Marks  Gender  Half_Marks  Gender_By_0/1
0  Priyang     98    Male        49.0              1
1   Aadhya     89  Female        44.5              0
2   Krisha     99  Female        49.5              0
3   Vedant     87    Male        43.5              1
4   Parshv     90    Male        45.0              1
5   Mittal     83  Female        41.5              0
6  Archana     99  Female        49.5              0

14. Drop columns

In [45]:
df1.drop(['Half_Marks','Gender_By_0/1'], axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female